Revit 2027 API
BuiltInFailures.RebarFailures.CannotCreateFreeFormSetDueToShortBar Property
 Cannot create the rebar set using the current references because at least one bar is below the minimum allowed length. Edit the covers and extents of the set and try the desired layout options again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateFreeFormSetDueToShortBar { get; }
Public Shared ReadOnly Property CannotCreateFreeFormSetDueToShortBar As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateFreeFormSetDueToShortBar {
	FailureDefinitionId^ get ();
}
static member CannotCreateFreeFormSetDueToShortBar : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace